Hierarchical indexing(multi-indexing)

In [1]:
import pandas as pd
import numpy as np

In [19]:
type(('Cal', 2000))

tuple

In [20]:
type([('Cal', 2000)])

list

In [2]:
#그냥 series로 다 묶어버리니까 가독성없는거지
index = [('Cal', 2000),('Cal',2010),('New',2000),('New',2010),('Tex',2000),('Tex',2010)]
pop = [33871648, 37523956, 18976457, 19378102, 20851820, 25145561]
pop = pd.Series(pop, index=index)
pop

(Cal, 2000)    33871648
(Cal, 2010)    37523956
(New, 2000)    18976457
(New, 2010)    19378102
(Tex, 2000)    20851820
(Tex, 2010)    25145561
dtype: int64

In [3]:
pop[('Cal',2010):('Tex',2000)]
#인덱스 번호 아니고 명시적인덱스쓰면 그것까지포함되는거니깐 tex2000까지 나옴

(Cal, 2010)    37523956
(New, 2000)    18976457
(New, 2010)    19378102
(Tex, 2000)    20851820
dtype: int64

In [4]:
#multiindex 즉, cal~들은 인덱스의 첫번째 라벨(실제 값). 저거의 레벨은 뭐 city 정도?. 2000~들은 인덱스의 두번째 라벨, year이 라벨이되겠지 그래서라서 계층적 조직 
#인덱스에 멀티 걸어서 멀티인덱스 객체만드는 식. 얘를 써줘야 그냥index 아니고 multi로 다중이 가능해짐
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('Cal', 2000),
            ('Cal', 2010),
            ('New', 2000),
            ('New', 2010),
            ('Tex', 2000),
            ('Tex', 2010)],
           )

In [5]:
pop=pop.reindex(index)
pop

Cal  2000    33871648
     2010    37523956
New  2000    18976457
     2010    19378102
Tex  2000    20851820
     2010    25145561
dtype: int64

In [6]:
#두번째 인덱스가 2010인 모든 데이터에 접근하고자 함. 이건 계층구조로 나누어놨기때문에 (cal, 2000) 이렇게 선택안하고 이렇게 그냥 선택할수있다는거
#다중계층인덱스의 benefit
pop[:, 2010]

Cal    37523956
New    19378102
Tex    25145561
dtype: int64

In [7]:
#unstack-멀티인덱스의 한 레벨을 칼럼으로 변경해주니까 옆으로 길어질수있겠찌
pop_df = pop.unstack()
pop_df

         2000      2010
Cal  33871648  37523956
New  18976457  19378102
Tex  20851820  25145561

In [8]:
pop_df.stack()

Cal  2000    33871648
     2010    37523956
New  2000    18976457
     2010    19378102
Tex  2000    20851820
     2010    25145561
dtype: int64

In [9]:
#pop은 시리즈고, 이 series를 딕셔너리에 밸류값으로 줄수가있음 그리고 dataFrame에 딕셔너리처럼 이것들을 주면 under18 이게 딱 같다붙은것처럼되노
pop_df=pd.DataFrame({'total':pop, 'under18':[9267000, 9284000, 4687000, 4318000, 5906300, 6879000]})
pop_df

             total  under18
Cal 2000  33871648  9267000
    2010  37523956  9284000
New 2000  18976457  4687000
    2010  19378102  4318000
Tex 2000  20851820  5906300
    2010  25145561  6879000

In [11]:
#인덱스는 그대로고, 데이터값만 내가 말한 저걸로 변경되었음을 알수있음. 
# 전에도 그렇고 그냥 data[column] / data[column] 하면 새로운 column가진 값이 생겨버리는거 그게 가능하다는걸 알기
f_u18=pop_df['under18'] / pop_df['total']
f_u18

Cal  2000    0.273592
     2010    0.247415
New  2000    0.246990
     2010    0.222829
Tex  2000    0.283251
     2010    0.273567
dtype: float64

In [12]:
f_u18.unstack()

         2000      2010
Cal  0.273592  0.247415
New  0.246990  0.222829
Tex  0.283251  0.273567

In [14]:
df=pd.DataFrame(np.random.rand(4,2),
                index=[['a','a','b','b'],[1,2,1,2]], #index 생성하면서 2개 이상의 배열만을 전달함으로서 다중인덱스 생성가능하다는거
               columns=['data1','data2'])
df

        data1     data2
a 1  0.136486  0.341428
  2  0.915383  0.053834
b 1  0.662300  0.279088
  2  0.684116  0.531802

In [15]:
#튜플:값 형태의 딕셔너리를 전달해도 기깔나게 series로 만들어준다고 
data = {('Cal', 2000):33871648,('Cal',2010):37523956,('New',2000):18976457,
        ('New',2010):19378102,('Tex',2000):20851820,('Tex',2010):25145561 }
pd.Series(data)

Cal  2000    33871648
     2010    37523956
New  2000    18976457
     2010    19378102
Tex  2000    20851820
     2010    25145561
dtype: int64

In [16]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [17]:
#인덱스네임을 이렇게 주면 레벨이 달린 채로 나옴
pop.index.names=['state','year']
pop

state  year
Cal    2000    33871648
       2010    37523956
New    2000    18976457
       2010    19378102
Tex    2000    20851820
       2010    25145561
dtype: int64

In [18]:
index=pd.MultiIndex.from_product([[2013,2014],[1,2]],
                                  names=['year','visit'])
columns=pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],
                                   names=['subject','type'])

In [21]:
#일부 데이터 모형만들기
data=np.round(np.random.randn(4,6),1)
data[:, ::2] *= 10
data += 37

#DataFrame 생성하기
health_data = pd.DataFrame(data,index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.8  44.0  36.4  29.0  35.5
     2      30.0  37.0  28.0  36.6  41.0  35.8
2014 1      31.0  36.6  61.0  35.9  36.0  37.2
     2      44.0  34.7  35.0  37.2  35.0  36.9

In [22]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      44.0  36.4
     2      28.0  36.6
2014 1      61.0  35.9
     2      35.0  37.2

In [23]:
#series 앞에서 만든거
pop

state  year
Cal    2000    33871648
       2010    37523956
New    2000    18976457
       2010    19378102
Tex    2000    20851820
       2010    25145561
dtype: int64

In [28]:
#이건 cal 해당하는것만 다시 series로 인덱싱해오는거 
pop['Cal']

year
2000    33871648
2010    37523956
dtype: int64

In [29]:
#행열 형식으로만 보는게 아니고, 인덱싱으로 단일 요소에 접근하는 개념 
pop['Cal',2000]

33871648

In [30]:
#series 아니고 multilindex 되어있는거를 가져오기도
pop.loc['Cal':'New']

state  year
Cal    2000    33871648
       2010    37523956
New    2000    18976457
       2010    19378102
dtype: int64

In [31]:
#모든행을 보면서, 2000인것만 가져올게
pop[:, 2000]

state
Cal    33871648
New    18976457
Tex    20851820
dtype: int64

In [35]:
#boolean을 이용하여 그 값만 가져오게 하기
pop[pop>25000000]

state  year
Cal    2000    33871648
       2010    37523956
Tex    2010    25145561
dtype: int64

In [37]:
#꼭 행렬로만 생각하면 안됨. cal.tex이름을 가진 행을 다 가져오려면 pop.loc 하고 여러행 가져오는거니까 [] 리스트까지 한번더 써주는거임 
#loc는 행, 안쓰고 그냥 [[]] 하면 열!!
pop.loc[['Cal','Tex']]

state  year
Cal    2000    33871648
       2010    37523956
Tex    2000    20851820
       2010    25145561
dtype: int64

In [41]:
#보통 다른거 없이 data[, ]어쩌구 하면 그건 다 열에 적용되는거임 
health_data['Guido','HR']

year  visit
2013  1        44.0
      2        28.0
2014  1        61.0
      2        35.0
Name: (Guido, HR), dtype: float64

In [42]:
#인덱스로 나누었을때는 묶음이 아니고 완전 개별로보는구나
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      43.0  36.8
     2      30.0  37.0

In [46]:
#loc나 iloc를 쓰면 튜플로전달가능
health_data.loc[:, ('Bob','HR')]

year  visit
2013  1        43.0
      2        30.0
2014  1        31.0
      2        44.0
Name: (Bob, HR), dtype: float64

In [44]:
health_data['Bob','HR']

year  visit
2013  1        43.0
      2        30.0
2014  1        31.0
      2        44.0
Name: (Bob, HR), dtype: float64

In [47]:
#IndexSlice라는 객체의 사용. 원하는 슬라이스를 명시적으로 만들고 에러를 피하기 위해 !! 
idx=pd.IndexSlice

#인덱스를 슬라이스하는거니까, idx[:, 1]는 첫번째레벨의 모든값을 보면서(행으로 가져온다)+두번째레벨이 1인것 이라는말!!
#즉 visit가 두번째 레벨인데, 그 값이 1인것만 가져온다고
#그리고 첫번째레벨 : 모든값 보면서+ 'HR' 열 가져온다고
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      43.0  44.0  29.0
2014 1      31.0  61.0  36.0

In [48]:
#이게 이해하기 젤쉽지 인덱스상 1,2행에서 모든열 이니까 
health_data.iloc[1:3, :]

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 2      30.0  37.0  28.0  36.6  41.0  35.8
2014 1      31.0  36.6  61.0  35.9  36.0  37.2

In [49]:
#unstack을 하면서 내가 어떤 레벨을 기준으로 할건지 지정할수있음 .
pop.unstack(level=0)

state       Cal       New       Tex
year
2000   33871648  18976457  20851820
2010   37523956  19378102  25145561

In [50]:
pop.unstack(level=1)

year       2000      2010
state
Cal    33871648  37523956
New    18976457  19378102
Tex    20851820  25145561

In [53]:
#**reset_index**메서드를 통해서, 전에 있던 정보를 그대로 (stat,year)유지하면서 pop데이터에다가 population 추가할수있음
#명확성을 위해 열에 표현할 데이터의 column명을 지정해준거 name=으로.
#원래 인덱스들을 열로 넣어주고,
#새로운 나만의 reset 012345의 정수형 인덱스를 reset해준다!!
pop_flat=pop.reset_index(name='population')
pop_flat

  state  year  population
0   Cal  2000    33871648
1   Cal  2010    37523956
2   New  2000    18976457
3   New  2010    19378102
4   Tex  2000    20851820
5   Tex  2010    25145561

In [54]:
#열 값으로부터 multiIndex 만들기. set_index통해서, 열값을 기준으로 놔두고 인덱스가 갈라지도록 
pop_flat.set_index(['state','year'])

            population
state year
Cal   2000    33871648
      2010    37523956
New   2000    18976457
      2010    19378102
Tex   2000    20851820
      2010    25145561

* NUMPY 배열 연결

In [55]:
x = [ 1, 2, 3]
y = [ 4, 5, 6]
z = [ 7, 8, 9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [56]:
x=[[1,2],[3, 4]]
#x.shape은 (2,2)인데 x 저거를 가로로 이어붙이라는거니까, y축고정이고 행에다가 덧붙일수있다는 얘기라서 
#12
#34 이렇게 생긴거에 또 가로로 x를 그냥 붙이는거라서
#1 2 1 2
#3 4 3 4 가 나옴  
#axis=1이면 y고정 그래서 x가 늘어난다. 그래서 열이 늘어난다는거!!
np.concatenate([x,x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [58]:
#반대로 x,x 붙이는데 axis=0이니까 (2,2)
#axis=0이면 x축고정. 행이늘어난다!! 
np.concatenate([x,x], axis=0)

array([[1, 2],
       [3, 4],
       [1, 2],
       [3, 4]])

In [59]:
#pd.concat() series를 연결해준다. 
ser1=pd.Series(['A','B','C'], index=[1,2,3])
ser2=pd.Series(['D','E','F'], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [63]:
def make_df(cols, ind):
     #빠르게 dataFrame 생성하도록 함수정함
     data = { c: [str(c) + str(i) for i in ind]
             for c in cols}
     return pd.DataFrame(data, ind)

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [75]:
class display(object):
     template="""<div style="float: left; padding: 10px;">
     <p style='font-family:"Courier New", Courier, monospace'>{0}{1}
     """
     def __init__(self, *args):
          self.args=args

     def _repr_html_(self):
          return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                           for a in self.args)
     
     def __repr__(self):
          return '\n\n'.join(a+'\n'+repr(eval(a))
                             for a in self.args)

In [66]:
#pd.concat으로 연결하기
df1=make_df('AB',[1,2])
df2=make_df('AB',[3,4])
print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [67]:
#위에서 아무것도 안정해줬을때는 행을 늘렸는데(아마 axis=0이었겠지?)
#pd.concat하면서 axis=1을 정해주니까 열을 늘려줌 가로로 붙여줌 
df3=make_df('AB', [0,1])
df4=make_df('CD', [0,1])
print(df3); print(df4); print(pd.concat([df3, df4], axis=1))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [71]:
pd.concat([df1, df2]).reset_index()

   index   A   B
0      1  A1  B1
1      2  A2  B2
2      3  A3  B3
3      4  A4  B4

In [72]:
#join='inner'로 열의 교집합으로 변경함!!!abc. cde를 합칠때 abcde 나오도록.
pd.concat([df1, df2], join='inner')

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

* 데이터세트 결합 : join, merge

In [83]:
df1=pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],
                  'group':['Accounting','Enginnering','Enginnering','HR']})
df2=pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],
                  'hire_date':[2004, 2008, 2012, 2014]})
print(df1), print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Enginnering
2     Lisa  Enginnering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

(None, None)

In [82]:
#홀리 신기 group.hire_date라는 칼럼명 가져오면서 합집합으로 merge해주노  순서도 알아서 맞춤 
df3=pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Enginnering       2012
2     Lisa  Enginnering       2004
3      Sue           HR       2014

In [84]:
df4=pd.DataFrame({'group':['Accounting','Enginnering','HR'],
                  'supervisor':['Carly','Guido','Steve']})
print(df3), print(df4), print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Enginnering       2012
2     Lisa  Enginnering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Enginnering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Enginnering       2012      Guido
2     Lisa  Enginnering       2004      Guido
3      Sue           HR       2014      Steve

(None, None, None)

In [85]:
df5=pd.DataFrame({'group':['Accounting','Accounting','Enginnering', 'Enginnering','HR','HR'],
                  'skills':['math','spreadsheets','coding','linux','spreadsheets','organization']})
print(df1),print(df5), print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Enginnering
2     Lisa  Enginnering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Enginnering        coding
3  Enginnering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Enginnering        coding
3     Jake  Enginnering         linux
4     Lisa  Enginnering        coding
5     Lisa  Enginnering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

(None, None, None)

In [86]:
#pd.merge 자체는 두개 입력값 사이에 일치하는 하나이상의 열을 키로 사용하는데 그럴경우가 잘 없으니까
#on='dslkfjl'을 통해서 키가 될 열의 이름을 명시적으로 정해줌
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Enginnering
2     Lisa  Enginnering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Enginnering       2012
2     Lisa  Enginnering       2004
3      Sue           HR       2014

In [104]:
#left_on, right_on은 그거를 기준으로 해서 병합된다는말. 
#df1에서는 employee~ df2에서는 name~부터 기준으로. 

df3 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'salary': [70000, 80000, 120000, 90000]
})
merged_df = pd.merge(df1, df3, left_on="employee", right_on="name")
merged_df

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Enginnering  Jake   80000
2     Lisa  Enginnering  Lisa  120000
3      Sue           HR   Sue   90000

In [95]:
#열값을 키 열로서. index로 정해주는거임 앞에 01234 떼지게 
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Enginnering
Lisa      Enginnering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [96]:
#left_idx true는 왼쪽 데이터의 인덱스를 기준으로 병합을 수행한다.
#right_idx true는 오른쪽 데이터의 인덱스 기준으로 
# 이 두개를 명시적으로 사용함으로써 병합 키로 인덱스 사용하도록 명시해주는거임 
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Enginnering       2012
Lisa      Enginnering       2004
Sue                HR       2014

In [97]:
print(df1a.join(df2a))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Enginnering       2012
Lisa      Enginnering       2004
Sue                HR       2014

In [105]:
#df1a의 인덱스를 기준으로 한다 -> 그 인덱스 자체를 기준으로 가져온다 는게 아니고
#그 인덱스를 병합의 기준으로 사용할거기 때문에, 
#걔의 인덱스 값과 일치하는 걸 가진 행들이 병합 대상이 됨!!!
#df3에는 employee열이나 인덱스로 설정된 것이 없기 때문에.
#merge는 병합 시 기준이 되는 열*을 기준으로 병합해서 뱉어내며, 일치하지 않는 다른 열은 무시함. 
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Enginnering  Jake   80000
2  Enginnering  Lisa  120000
3           HR   Sue   90000

In [108]:
pop=pd.read_csv('./state-population.csv')
areas=pd.read_csv('./state-areas.csv')
abbrevs=pd.read_csv('./state-abbrevs.csv')

In [109]:
print(pop.head()); print(areas.head()); print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [123]:
#how='outer' 레이블 일치하지 않아도 가져오도록 하고, 
#right_on='abbreviation' 은 오른쪽의 이 열을 병합의 기준으로 사용하겠다. 
#약간 키 연결해주는것처럼 생각하면됨 이름이 달라도.. 
merged = pd.merge(pop, abbrevs, how='outer', left_on='state/region', right_on='abbreviation')
#abbre~이름의 열을 drop하고 나타내겠다. 중복 정보 삭제를 위해!! 
merged = merged.drop('abbreviation', axis=1)
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [124]:
#갑자기 헷갈려서 써본.. 딕셔너리로 만들었을때 키는 열값이 된다. 
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [125]:
merged.isnull().any()
#어떤any가...null이 있나요? 헐.pop이랑 state에 null이 하나라도 있다함

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [126]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN

In [127]:
#state열 중 null이 있는 것들 중에서, state/region의 고유한 값들을 나타내시오. 
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

* Memory에서의 GROUP BY 사용

In [129]:
pip install seaborn

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
     -------------------------------------- 294.9/294.9 KB 4.6 MB/s eta 0:00:00
Requirement already satisfied: pandas>=1.2 in c:\users\user\appdata\roaming\python\python39\site-packages (from seaborn) (2.2.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\user\appdata\roaming\python\python39\site-packages (from seaborn) (3.9.0)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\user\appdata\roaming\python\python39\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.51.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.1)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: packaging>=20.0 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: cycler>=0.10 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: importlib-resources>=3.2.0 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (6.4.0)
Requirement already satisfied: pillow>=8 in c:\users\user\appdata\roaming\python\python39\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.3.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\roaming\python\python39\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\roaming\python\python39\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: zipp>=3.1.0 in c:\users\user\appdata\roaming\python\python39\site-packages (from importlib-resources>=3.2.0->matplotlib!=3.6.1,>=3.4->seaborn) (3.18.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python39\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Installing collected packages: seaborn
Successfully installed seaborn-0.13.2
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.4; however, version 24.1 is available.
You should consider upgrading via the 'c:\Users\user\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [130]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [131]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [132]:
rng=np.random.RandomState(42)
ser=pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [133]:
df=pd.DataFrame({'A':rng.rand(5),
                 'B':rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [134]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [135]:
#axis=열이라니까 열 방향 이라서 행기준으로 계산함.
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [136]:
planets.groupby('method')

In [137]:
planets.groupby('method')['orbital_period']

In [138]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [139]:
for (method, group) in planets.groupby('method'):
     print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [141]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [144]:
df=pd.DataFrame({'key':['A','B','C','A','B','C'],'data':range(6)}, 
                columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [146]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [147]:
rng=np.random.RandomState(0)
df=pd.DataFrame({'key':['A','B','C','A','B','C'],'data1':range(6), 'data2':rng.randint(0,10,6)},
                columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [148]:
#aggregate-집계해주는아이
df.groupby('key').aggregate(['min',np.median, max])

C:\Users\user\AppData\Local\Temp\ipykernel_14364\1691318855.py:1: FutureWarning: The provided callable <function median at 0x000001E6E6A9BC10> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate(['min',np.median, max])
C:\Users\user\AppData\Local\Temp\ipykernel_14364\1691318855.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate(['min',np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [149]:
#aggregate- '{'열':'함수' } 이렇게 써주면 그걸 나타내는애를 뱉어줌
df.groupby('key').aggregate({'data1':'min', 'data2':'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [150]:
L = [0,1,0,1,2,0]
#L을 기준으로 한다고 할때, 
#각 L[0]은 df랑 대응해가지고 data a, 0 ,5 를 가져오고 
#또 L[2] 얘는 c, 2, 3 이고 L[5]는 c, 5, 9라서
#이거를.. 그 행의 수를 대응하는것만 가지고 이따위로.. 히얀한계산을 해오는거네... 
print(df); print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   key  data1  data2
0  ACC      7     17
1   BA      4      3
2    B      4      7